merlokk/ai-remote/approver-esp32/components/wifi/wifi_radio.cpp
#include "wifi_radio.h"

#include <cstdio>
#include <cstring>

#include "esp_event.h"
#include "esp_log.h"
#include "esp_netif.h"
#include "esp_wifi.h"
#include "nvs_flash.h"
#include "soc/soc_caps.h"

namespace wifi {

namespace {

constexpr const char *TAG = "wifi";

// The scan's landing area. Static, because nothing here allocates (§10.14.1),
// and in the `.cpp` because keeping `wifi_ap_record_t` out of the header is
// what lets `wifi_radio.h` be read without ESP-IDF in the picture. About
// 1.5 KB, present whether or not anybody scans — which is the honest cost of
// the rule and is why sixteen and not sixty-four.
wifi_ap_record_t scan_records[kMaxScanResults];

// Copies into a fixed field, refusing rather than truncating — the call
// `config.cpp` makes about the same two strings, for the same reason: half an
// SSID fails to connect and gives no hint which half is being used.
bool CopyField(char *out, size_t capacity, const char *in) {
    const size_t length = in == nullptr ? 0 : strlen(in);
    if (length >= capacity) {
        return false;
    }
    memcpy(out, in == nullptr ? "" : in, length + 1);
    return true;
}

}  // namespace

// --- classification ---------------------------------------------------------

Failure Radio::Classify(uint8_t reason) {
    switch (reason) {
        // The password. `4WAY_HANDSHAKE_TIMEOUT` is what this chip reports for
        // a wrong WPA2 passphrase far more often than `AUTH_FAIL` — the AP
        // does not say "wrong", it simply stops answering the handshake.
        case WIFI_REASON_MIC_FAILURE:
        case WIFI_REASON_4WAY_HANDSHAKE_TIMEOUT:
        case WIFI_REASON_AUTH_FAIL:
        case WIFI_REASON_HANDSHAKE_TIMEOUT:
            return Failure::kAuth;

        // Nothing on the air with that name. The three qualified variants are
        // here too: they mean the network was not found *under the constraints
        // we set*, which from the operator's side is the same problem and
        // never a password to retype. §10.9 asks for that to be reported
        // differently from a refusal, and this is the line that does it.
        case WIFI_REASON_NO_AP_FOUND:
        case WIFI_REASON_NO_AP_FOUND_W_COMPATIBLE_SECURITY:
        case WIFI_REASON_NO_AP_FOUND_IN_AUTHMODE_THRESHOLD:
        case WIFI_REASON_NO_AP_FOUND_IN_RSSI_THRESHOLD:
            return Failure::kNotFound;

        default:
            return Failure::kOther;
    }
}

const char *Radio::Name(Mode mode) {
    switch (mode) {
        case Mode::kOff:
            return "off";
        case Mode::kClient:
            return "client";
        case Mode::kAp:
            return "ap";
    }
    return "?";
}

const char *Radio::Name(Link link) {
    switch (link) {
        case Link::kIdle:
            return "idle";
        case Link::kConnecting:
            return "connecting";
        case Link::kConnected:
            return "connected";
        case Link::kFailed:
            return "failed";
    }
    return "?";
}

const char *Radio::Name(Failure failure) {
    switch (failure) {
        case Failure::kNone:
            return "none";
        case Failure::kAuth:
            return "wrong password";
        case Failure::kNotFound:
            return "no such network";
        case Failure::kOther:
            return "disconnected";
    }
    return "?";
}

// --- bring-up ---------------------------------------------------------------

esp_err_t Radio::Init() {
    if (ready_) {
        return ESP_OK;
    }

    lock_ = xSemaphoreCreateMutexStatic(&lock_storage_);
    if (lock_ == nullptr) {
        return ESP_ERR_NO_MEM;
    }

    // **NVS holds nothing of ours** (§10.15) — it is initialised because
    // `esp_wifi` keeps its calibration and PHY data there and will not start
    // without it. A partition that is full or was written by a newer format is
    // erased rather than treated as fatal: what is in it is regenerable, and a
    // device that will not bring up its radio is worse than one that
    // recalibrates.
    esp_err_t err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_LOGW(TAG, "nvs unusable (%s); erasing it", esp_err_to_name(err));
        ESP_ERROR_CHECK(nvs_flash_erase());
        err = nvs_flash_init();
    }
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "nvs_flash_init: %s", esp_err_to_name(err));
        return err;
    }

    err = esp_netif_init();
    if (err != ESP_OK) {
        return err;
    }

    // Somebody else may already own the default loop — `esp_console` does not,
    // but the day something does, that is not an error for this component.
    err = esp_event_loop_create_default();
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        return err;
    }

    // **Registered once and never unregistered**, which is why they are in
    // this half: an event handler is attached to the loop rather than to the
    // Wi-Fi driver, so it survives the stack being torn down and put back up.
    // Registering before there is anything to post events is fine — an event
    // base is a symbol, not a subscription to something running.
    err = esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID, &EventTrampoline, this,
                                              nullptr);
    if (err == ESP_OK) {
        err = esp_event_handler_instance_register(IP_EVENT, IP_EVENT_STA_GOT_IP, &EventTrampoline,
                                                  this, nullptr);
    }
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "event handlers: %s", esp_err_to_name(err));
        return err;
    }

    ready_ = true;
    ESP_LOGI(TAG, "radio ready (the stack is not up — that is the manager's call)");
    return ESP_OK;
}

esp_err_t Radio::EnsureStack() {
    if (stack_ready_) {
        return ESP_OK;
    }

    // **The netifs are made here and destroyed in `ReleaseStack`**, not kept
    // for the life of the device. `esp_netif_create_default_wifi_sta()` may
    // not be called twice for the same interface, so a stack that comes back
    // up needs them created again rather than reused — which is the whole
    // reason bring-up is in two halves rather than one. They also have to
    // exist *before* `esp_wifi_init`, which is the order every ESP-IDF example
    // uses and the order below.
    sta_netif_ = esp_netif_create_default_wifi_sta();
    ap_netif_ = esp_netif_create_default_wifi_ap();
    if (sta_netif_ == nullptr || ap_netif_ == nullptr) {
        ReleaseStack();
        return ESP_FAIL;
    }

    wifi_init_config_t init = WIFI_INIT_CONFIG_DEFAULT();
    esp_err_t err = esp_wifi_init(&init);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_wifi_init: %s", esp_err_to_name(err));
        // The netifs are up and the stack is not; leaving them would leak a
        // pair that the next attempt could not create again.
        esp_netif_destroy_default_wifi(sta_netif_);
        esp_netif_destroy_default_wifi(ap_netif_);
        sta_netif_ = nullptr;
        ap_netif_ = nullptr;
        return err;
    }

    // **§10.9, and it is the reason `config.json` is worth anything.** The
    // driver's own credential store would be a second record of what this
    // device knows — one that a config restore does not clear and that nobody
    // can read off a `cat`. There is one record, and it is the file.
    //
    // It has to be set after every `esp_wifi_init`, not once at boot: the
    // setting lives in the stack that was just created.
    err = esp_wifi_set_storage(WIFI_STORAGE_RAM);
    if (err != ESP_OK) {
        return err;
    }

    stack_ready_ = true;
    return ESP_OK;
}

void Radio::ReleaseStack() {
    if (started_) {
        esp_wifi_stop();
        started_ = false;
    }
    if (stack_ready_) {
        esp_wifi_deinit();
        stack_ready_ = false;
    }
    // Destroyed in the opposite order to their creation, and only if they were
    // made: `esp_netif_destroy_default_wifi` on a null pointer is not a call
    // worth finding out about.
    if (ap_netif_ != nullptr) {
        esp_netif_destroy_default_wifi(ap_netif_);
        ap_netif_ = nullptr;
    }
    if (sta_netif_ != nullptr) {
        esp_netif_destroy_default_wifi(sta_netif_);
        sta_netif_ = nullptr;
    }
    // Nothing can post an event now, so anything we were waiting to ignore is
    // never coming.
    want_connect_ = false;
    suppress_disconnect_ = 0;
}

// --- what the radio is asked to do ------------------------------------------

esp_err_t Radio::EnsureStarted() {
    if (started_) {
        return ESP_OK;
    }
    const esp_err_t err = esp_wifi_start();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_wifi_start: %s", esp_err_to_name(err));
        return err;
    }
    started_ = true;
    return ESP_OK;
}

void Radio::StopStation() {
    if (!started_) {
        return;
    }
    SuppressNextDisconnect();
    esp_wifi_disconnect();
    esp_wifi_stop();
    started_ = false;
    want_connect_ = false;
}

esp_err_t Radio::StartClient(const char *ssid, const char *password) {
    if (!ready_) {
        return ESP_ERR_INVALID_STATE;
    }
    if (scanning_) {
        // Refused rather than queued: the caller is a state machine that will
        // ask again on its next pass, and a queued join behind a scan is a
        // join whose credentials may have been edited by the time it runs.
        return ESP_ERR_INVALID_STATE;
    }
    if (ssid == nullptr || ssid[0] == '\0') {
        return ESP_ERR_INVALID_ARG;
    }

