merlokk/ai-remote/approver-esp32/components/wifi/wifi_radio.cpp
    wifi_config_t config = {};
    if (!CopyField(reinterpret_cast<char *>(config.sta.ssid), sizeof(config.sta.ssid), ssid) ||
        !CopyField(reinterpret_cast<char *>(config.sta.password), sizeof(config.sta.password),
                   password)) {
        ESP_LOGE(TAG, "ssid or password longer than 802.11 allows");
        return ESP_ERR_INVALID_ARG;
    }

    // **The threshold is left at OPEN, which is not a security decision.** It
    // is the *minimum* authmode this station will accept from an AP; setting
    // it to WPA2 makes an open café network and a WPA3-only router both
    // vanish, and §10.9 wants open, WPA2 and WPA3-SAE all joinable. What
    // actually protects the link is the AP's own security, not our floor.
    //
    // And ESP-IDF does not entirely leave it alone, which is worth knowing
    // before somebody reads the two as contradicting each other. Measured on
    // this board: with a password set it raises the floor itself and says so —
    //
    //   W wifi: Password length matches WPA2 standards, authmode threshold
    //           changes from OPEN to WPA2
    //
    // — so a network we hold a password for will not be joined if it is
    // suddenly open. That is the framework's call and the right one; what this
    // line still buys is the *passwordless* case staying joinable.
    config.sta.threshold.authmode = WIFI_AUTH_OPEN;
    config.sta.sae_pwe_h2e = WPA3_SAE_PWE_BOTH;
    // Retries are the policy's, not the driver's (§10.9): this driver reports
    // one outcome per attempt and lets `wifimgr` decide what it means.
    config.sta.failure_retry_cnt = 0;

    // The stack, if this is the first thing to want it since boot or since the
    // last `Stop`. Validated arguments first, so a typo does not pay for it.
    const esp_err_t stack = EnsureStack();
    if (stack != ESP_OK) {
        return stack;
    }

    // Whatever the station was doing is over. The disconnection this produces
    // is ours, and reporting it as a failure would fail the attempt below
    // before it started.
    if (started_) {
        SuppressNextDisconnect();
        esp_wifi_disconnect();
    }

    esp_err_t err = esp_wifi_set_mode(WIFI_MODE_STA);
    if (err == ESP_OK) {
        err = esp_wifi_set_config(WIFI_IF_STA, &config);
    }
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "station config: %s", esp_err_to_name(err));
        return err;
    }

    {
        Status update = {};
        update.mode = Mode::kClient;
        update.link = Link::kConnecting;
        CopyField(update.ssid, sizeof(update.ssid), ssid);
        xSemaphoreTake(lock_, portMAX_DELAY);
        update.changes = status_.changes + 1;
        status_ = update;
        xSemaphoreGive(lock_);
    }

    if (!started_) {
        // The association is started from the `STA_START` event rather than
        // here: calling `esp_wifi_connect` before the driver has finished
        // starting is the documented way to get `ESP_ERR_WIFI_STATE`.
        want_connect_ = true;
        err = EnsureStarted();
        if (err != ESP_OK) {
            want_connect_ = false;
            SetLink(Link::kFailed, Failure::kOther, 0);
        }
        return err;
    }

    err = esp_wifi_connect();
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "connect to '%s': %s", ssid, esp_err_to_name(err));
        SetLink(Link::kFailed, Failure::kOther, 0);
    }
    return err;
}

esp_err_t Radio::StartAp(const char *ssid, const char *password, uint8_t channel) {
    if (!ready_) {
        return ESP_ERR_INVALID_STATE;
    }
    if (scanning_) {
        return ESP_ERR_INVALID_STATE;
    }
    if (ssid == nullptr || ssid[0] == '\0') {
        return ESP_ERR_INVALID_ARG;
    }

    const size_t password_length = password == nullptr ? 0 : strlen(password);
    if (password_length != 0 && password_length < kMinApPasswordLength) {
        // Refused, not downgraded. WPA2 will not take a passphrase this short,
        // and the failure mode of "accept it and open the network instead" is
        // an access point somebody believes is protected.
        ESP_LOGE(TAG, "an AP password must be %u characters or more, or empty for an open network",
                 static_cast<unsigned>(kMinApPasswordLength));
        return ESP_ERR_INVALID_ARG;
    }

    wifi_config_t config = {};
    if (!CopyField(reinterpret_cast<char *>(config.ap.ssid), sizeof(config.ap.ssid), ssid) ||
        !CopyField(reinterpret_cast<char *>(config.ap.password), sizeof(config.ap.password),
                   password)) {
        return ESP_ERR_INVALID_ARG;
    }
    config.ap.ssid_len = static_cast<uint8_t>(strlen(ssid));
    config.ap.channel = channel;
    config.ap.authmode = password_length == 0 ? WIFI_AUTH_OPEN : WIFI_AUTH_WPA2_PSK;
    // Four is the whole point of the thing: one operator with one phone or one
    // laptop, and headroom for the second attempt after the first went wrong.
    config.ap.max_connection = 4;
    config.ap.pmf_cfg.required = false;

    const esp_err_t stack = EnsureStack();
    if (stack != ESP_OK) {
        return stack;
    }

    if (started_) {
        SuppressNextDisconnect();
        esp_wifi_disconnect();
    }

    // **APSTA rather than AP**, and the station half is deliberately idle. A
    // scan needs the station interface, and the moment somebody most needs to
    // scan is exactly this one — the fallback AP went up because nothing would
    // have us, and the next thing they will do is look for a network to type a
    // password for. In plain `WIFI_MODE_AP` that scan is not possible at all.
    esp_err_t err = esp_wifi_set_mode(WIFI_MODE_APSTA);
    if (err == ESP_OK) {
        err = esp_wifi_set_config(WIFI_IF_AP, &config);
    }
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "ap config: %s", esp_err_to_name(err));
        return err;
    }

    {
        Status update = {};
        update.mode = Mode::kAp;
        update.link = Link::kIdle;
        CopyField(update.ssid, sizeof(update.ssid), ssid);
        xSemaphoreTake(lock_, portMAX_DELAY);
        update.changes = status_.changes + 1;
        status_ = update;
        xSemaphoreGive(lock_);
    }

    err = EnsureStarted();
    if (err == ESP_OK) {
        ESP_LOGI(TAG, "access point '%s' up on channel %u, %s", ssid, static_cast<unsigned>(channel),
                 password_length == 0 ? "open" : "wpa2");
    }
    return err;
}

esp_err_t Radio::Stop() {
    if (!ready_ || (!started_ && !stack_ready_)) {
        return ESP_OK;
    }

    // **Off means off, including the heap.** `ReleaseStack` stops the station,
    // deinitialises and destroys the netifs; the ~41 KB the Wi-Fi stack holds
    // goes back to a part that has 512 KB and no way to add more (§10.1).
    if (started_) {
        SuppressNextDisconnect();
        esp_wifi_disconnect();
    }
    ReleaseStack();
    const esp_err_t err = ESP_OK;

    Status update = {};
    xSemaphoreTake(lock_, portMAX_DELAY);
    update.changes = status_.changes + 1;
    status_ = update;
    xSemaphoreGive(lock_);
    return err;
}

