merlokk/ai-remote/approver-esp32/components/wifi/wifi_radio.cpp
Status Radio::Get() const {
    // The signal, read **before** the lock is taken: `esp_wifi_sta_get_ap_info`
    // goes into the Wi-Fi task, and the one rule this lock has is that it is
    // never held across a call that can block on the radio.
    int8_t rssi = 0;
    bool have_rssi = false;
    if (started_ && status_.link == Link::kConnected) {
        wifi_ap_record_t record = {};
        if (esp_wifi_sta_get_ap_info(&record) == ESP_OK) {
            rssi = record.rssi;
            have_rssi = true;
        }
    }

    xSemaphoreTake(lock_, portMAX_DELAY);
    Status copy = status_;
    xSemaphoreGive(lock_);
    if (have_rssi) {
        copy.rssi = rssi;
    }
    return copy;
}

// **The scan covers 2.4 GHz because that is every band this chip has**, and
// the assertion below is the only honest way to write that down: it is not a
// choice this code made and not one it can revisit. ESP-IDF marks a dual-band
// part with `SOC_WIFI_SUPPORT_5G` — defined for the ESP32-C5, absent for the
// C6 on this board (`soc/esp32c6/include/soc/soc_caps.h`, checked, not
// assumed). There is no `WIFI_BAND_MODE_AUTO` to set here and no 5 GHz channel
// bitmap to fill in; the radio does not receive on those frequencies.
//
// So this line exists for the day somebody ports this to a part that does:
// then `esp_wifi_set_band_mode(WIFI_BAND_MODE_AUTO)` belongs in `Init`, the
// scan should report each result's band, and §10.9's "2.4 GHz only" paragraph
// stops being true. A compile error is the right way to be told that, and it
// costs nothing until it happens.
#if defined(SOC_WIFI_SUPPORT_5G) && SOC_WIFI_SUPPORT_5G
#error "This chip has a 5 GHz radio: Scan() must select the band and report it (§10.9)."
#endif

esp_err_t Radio::Scan(ScanResult *out, size_t capacity, size_t *found) {
    if (out == nullptr || found == nullptr || capacity == 0) {
        return ESP_ERR_INVALID_ARG;
    }
    *found = 0;
    if (!ready_) {
        return ESP_ERR_INVALID_STATE;
    }
    if (scanning_) {
        return ESP_ERR_INVALID_STATE;
    }

    // **Set before anything is brought up**, so that nothing can start an
    // association in the window between the station going up and the scan
    // beginning: `StartClient` and `StartAp` both refuse while this is true.
    scanning_ = true;

    // **A scan with the radio off brings the station up on its own and puts it
    // back.** "What is on the air" is the first question an operator asks and
    // the last one that should require the device to already be somewhere.
    //
    // The station interface, and nothing else. Raising an access point to make
    // a scan possible — even a hidden one — is strictly *more* radio than the
    // job needs: a hidden AP still beacons (hidden means the SSID field is
    // blank, not that the AP is silent), still holds a channel and still
    // starts a DHCP server, and all of it would have to be undone afterwards.
    // A started station transmits probe requests while scanning and nothing at
    // all otherwise.
    //
    // **Whatever had to be raised is put back**, at both levels: the Wi-Fi
    // stack costs about 41 KB of heap (160 KB free with it down against
    // 119 KB with it up, measured on this board), so a scan on a device that
    // lives with the radio off borrows that for two seconds rather than
    // keeping it until the next reboot.
    const bool stack_was_ours = !stack_ready_;
    const bool station_was_off = !started_;
    if (stack_was_ours) {
        const esp_err_t up = EnsureStack();
        if (up != ESP_OK) {
            scanning_ = false;
            ESP_LOGW(TAG, "scan needed the stack up and it would not start: %s",
                     esp_err_to_name(up));
            return up;
        }
    }
    if (station_was_off) {
        esp_err_t up = esp_wifi_set_mode(WIFI_MODE_STA);
        if (up == ESP_OK) {
            up = EnsureStarted();
        }
        if (up != ESP_OK) {
            if (stack_was_ours) {
                ReleaseStack();
            }
            scanning_ = false;
            ESP_LOGW(TAG, "scan needed the station up and it would not start: %s",
                     esp_err_to_name(up));
            return up;
        }
    }

    // Undoes exactly what was raised, in one place, so the three exits below
    // cannot disagree about it.
    const auto put_back = [this, stack_was_ours, station_was_off]() {
        if (stack_was_ours) {
            ReleaseStack();
        } else if (station_was_off) {
            StopStation();
        }
    };

    wifi_scan_config_t config = {};  // active scan, every channel, no filter
    esp_err_t err = esp_wifi_scan_start(&config, true);
    if (err != ESP_OK) {
        put_back();
        scanning_ = false;
        ESP_LOGW(TAG, "scan: %s", esp_err_to_name(err));
        return err;
    }

    uint16_t number = kMaxScanResults;
    err = esp_wifi_scan_get_ap_records(&number, scan_records);
    // Back to how it was found, and *before* `scanning_` is cleared, so the
    // manager cannot start something in between and have it torn down.
    put_back();
    scanning_ = false;
    if (err != ESP_OK) {
        // The records are freed by the call above whether or not it succeeded;
        // this is the belt-and-braces for the path where it did not run at all.
        esp_wifi_clear_ap_list();
        return err;
    }

    // Already sorted by signal — `esp_wifi_scan_get_ap_records` returns them
    // strongest first, which is the order §10.8.6's list wants.
    const size_t limit = number < capacity ? number : capacity;
    for (size_t i = 0; i < limit; ++i) {
        CopyField(out[i].ssid, sizeof(out[i].ssid),
                  reinterpret_cast<const char *>(scan_records[i].ssid));
        out[i].rssi = scan_records[i].rssi;
        out[i].channel = scan_records[i].primary;
        out[i].secured = scan_records[i].authmode != WIFI_AUTH_OPEN;
    }
    *found = limit;
    return ESP_OK;
}

// --- events -----------------------------------------------------------------

void Radio::EventTrampoline(void *arg, const char *base, int32_t id, void *data) {
    static_cast<Radio *>(arg)->OnEvent(base, id, data);
}

void Radio::SetLink(Link link, Failure failure, uint8_t reason) {
    xSemaphoreTake(lock_, portMAX_DELAY);
    status_.link = link;
    status_.failure = failure;
    status_.reason = reason;
    if (link != Link::kConnected) {
        status_.ip = 0;
    }
    ++status_.changes;
    xSemaphoreGive(lock_);
}

void Radio::OnEvent(const char *base, int32_t id, void *data) {
    if (base == WIFI_EVENT) {
        switch (id) {
            case WIFI_EVENT_STA_START:
                if (want_connect_) {
                    want_connect_ = false;
                    const esp_err_t err = esp_wifi_connect();
                    if (err != ESP_OK) {
                        ESP_LOGW(TAG, "connect on start: %s", esp_err_to_name(err));
                        SetLink(Link::kFailed, Failure::kOther, 0);
                    }
                }
                break;

            case WIFI_EVENT_STA_DISCONNECTED: {
                if (suppress_disconnect_ > 0) {
                    // Ours. We tore the association down to start another one,
                    // and the new attempt is already recorded as connecting.
                    suppress_disconnect_ = static_cast<uint8_t>(suppress_disconnect_ - 1);
                    break;
                }
                const auto *event = static_cast<const wifi_event_sta_disconnected_t *>(data);
                const uint8_t reason = event != nullptr ? event->reason : 0;
                ESP_LOGW(TAG, "disconnected: reason %u (%s)", static_cast<unsigned>(reason),
                         Name(Classify(reason)));
                SetLink(Link::kFailed, Classify(reason), reason);
                break;
            }

            case WIFI_EVENT_AP_START: {
                esp_netif_ip_info_t info = {};
                if (ap_netif_ != nullptr &&
                    esp_netif_get_ip_info(static_cast<esp_netif_t *>(ap_netif_), &info) == ESP_OK) {
                    xSemaphoreTake(lock_, portMAX_DELAY);
                    status_.ip = info.ip.addr;
                    xSemaphoreGive(lock_);
                }
                break;
            }

            case WIFI_EVENT_AP_STACONNECTED:
                xSemaphoreTake(lock_, portMAX_DELAY);
                if (status_.clients < 0xFF) {
                    ++status_.clients;
                }
                ++status_.changes;
                xSemaphoreGive(lock_);
                break;

            case WIFI_EVENT_AP_STADISCONNECTED:
                xSemaphoreTake(lock_, portMAX_DELAY);
                if (status_.clients > 0) {
                    --status_.clients;
                }
                ++status_.changes;
                xSemaphoreGive(lock_);
                break;

            default:
                break;
        }
        return;
    }

    if (base == IP_EVENT && id == IP_EVENT_STA_GOT_IP) {
        const auto *event = static_cast<const ip_event_got_ip_t *>(data);
        esp_ip4_addr_t address = {};
        if (event != nullptr) {
            address = event->ip_info.ip;
        }
        xSemaphoreTake(lock_, portMAX_DELAY);
        status_.link = Link::kConnected;
        status_.failure = Failure::kNone;
        status_.reason = 0;
        status_.ip = address.addr;
        ++status_.changes;
        xSemaphoreGive(lock_);
        ESP_LOGI(TAG, "connected to '%s', ip " IPSTR, status_.ssid, IP2STR(&address));
    }
}

}  // namespace wifi
